{"is404":false,"staticData":{"364408558":"{\"parsedFrontmatter\":{\"title\":\"Gren 0.1.0 is released\",\"published\":\"2022-05-30\"},\"withoutFrontmatter\":\"\\nToday marks the first release of Gren, a programming language that helps you write simple and correct software.\\n\\nGren aims to be a small language that is easy to learn, and easy to understand. It wants to help you write correct software by being your assistant, pointing out likely mistakes as you write code. Finally, it tries to available wherever you need it to be, so that you can use it to write CLI tools, backend- or even frontend applications.\\n\\nThere already exist a language that is close to matching this description: [Elm](https://elm-lang.org). What Elm lacks is better support for Web API's, and official support for running outside the browser.\\n\\nWhile we could spend considerable time and effort in creating a language which would look very similar to Elm, we've instead decided to fork the compiler and core packages, and use that as the basis of Gren.\\n\\n### Differences from Elm\\n\\nIf you already know Elm, then you also know Gren. Even the core packages are similar. That said, there are some differences:\\n\\n* A git-based package manager. It's slower, but has access to any github repo that you have, even private ones.\\n* Extended support for pattern matching on records.\\n* The default sequential data structure is an immutable array, not a linked list.\\n* No tuples.\\n* No automatic constructors for type aliased records.\\n* No GLSL syntax.\\n* No reactor.\\n\\nIf you have no experience with Elm, you can read more about the language in our official [guide](/learn). If you'd like to try it out, you can find instructions on getting started [here](/install).\\n\\nVersion 0.1.0 is considered to be an alpha release. While you can write production quality software with it today, there are likely bugs in the compiler and core packages, and breaking changes are planned for the next release.\\n\\nIf you like what you see, consider joining the [community](/community). We can use all the help we can get.\\n\\n### Looking forward\\n\\nGren follows a six-month release cadence. The next release will be v0.2.0 and be made available in December.\\n\\nThe plan is to add support for more Web API's and basic support for applications running on the NodeJS runtime. In addition, the package manager will see become more efficient and reliable.\\n\\n### Thank you, contributors\\n\\nThis release of Gren was made possible by people who've written new code, ported packages from Elm and provided valuable feedback on [Zulip](https://gren.zulipchat.com). Those people are, in alphabetic order:\\n\\n* Aaron VonderHaar\\n* Allan Clark\\n* Dimitri B.\\n* Gabriella Sartori\\n* Gaute Berge\\n* Harry Sarson\\n* Jeroen Engels\\n* Joaquin\\n* Julian Antonielli\\n* Lue\\n* Mario Rogic\\n* Oliver Schöning\\n* Ragnhild Aalvik\\n* Robin Heggelund Hansen\\n\\nThank you!\\n\"}","628379327":"[\"articles/220530_first_release.md\"]"},"path":"news"}