{"is404":false,"staticData":{"364408558":"{\"parsedFrontmatter\":{\"title\":\"Gren 0.1.0 is released\",\"published\":\"2022-05-30\"},\"withoutFrontmatter\":\"\\nToday marks the first release of Gren, a programming language that helps you write simple and correct software.\\n\\nGren aims to be a small language that is easy to learn, and easy to understand. It wants to help you write correct software by being your assistant, pointing out likely mistakes as you write code. Finally, it tries to be available wherever you need it to be, so that you can use it to write CLI tools, backend- or even frontend applications.\\n\\nThere already exist a language that is close to matching this description: [Elm](https://elm-lang.org). What Elm lacks is better support for Web API's, and official support for running outside the browser.\\n\\nWhile we could spend considerable time and effort in creating a language which would look very similar to Elm, we've instead decided to fork the compiler and core packages, and use that as the basis of Gren.\\n\\n### Differences from Elm\\n\\nIf you already know Elm, then you also know Gren. Even the core packages are similar. That said, there are some differences:\\n\\n* A git-based package manager. It's slower, but has access to any github repo that you have, even private ones.\\n* Extended support for pattern matching on records.\\n* The default sequential data structure is an immutable array, not a linked list.\\n* No tuples.\\n* No automatic constructors for type aliased records.\\n* No GLSL syntax.\\n* No reactor.\\n\\nIf you have no experience with Elm, you can read more about the language in our official [guide](/learn). If you'd like to try it out, you can find instructions on getting started [here](/install).\\n\\nVersion 0.1.0 is considered to be an alpha release. While you can write production quality software with it today, there are likely bugs in the compiler and core packages, and breaking changes are planned for the next release.\\n\\nIf you like what you see, consider joining the [community](/community). We can use all the help we can get.\\n\\n### Looking forward\\n\\nGren follows a six-month release cadence. The next release will be v0.2.0 and be made available in December.\\n\\nThe plan is to add support for more Web API's and basic support for applications running on the NodeJS runtime. In addition, the package manager will become more efficient and reliable.\\n\\n### Thank you, contributors\\n\\nThis release of Gren was made possible by people who've written new code, ported packages from Elm and provided valuable feedback on [Zulip](https://gren.zulipchat.com). Those people are, in alphabetic order:\\n\\n* Aaron VonderHaar\\n* Allan Clark\\n* Dimitri B.\\n* Gabriella Sartori\\n* Gaute Berge\\n* Harry Sarson\\n* Jeroen Engels\\n* Joaquin\\n* Julian Antonielli\\n* Lue\\n* Mario Rogic\\n* Oliver Schöning\\n* Ragnhild Aalvik\\n* Robin Heggelund Hansen\\n\\nThank you!\\n\"}","628379327":"[\"articles/220530_first_release.md\",\"articles/220822_documentation_as_a_first_class_citizen.md\",\"articles/221212_hello_nodejs.md\",\"articles/230315_testing_testing.md\",\"articles/230619_sourcemaps.md\",\"articles/240321_gren_in_gren.md\",\"articles/240624_gren_04.md\",\"articles/240724_announcing_core_team.md\",\"articles/240819_upcoming_language_changes.md\",\"articles/240826_gren_045.md\"]","1331298449":"{\"parsedFrontmatter\":{\"title\":\"Announcing the Gren Core Team\",\"published\":\"2024-07-24\"},\"withoutFrontmatter\":\"\\nToday we celebrate a significant milestone for the Gren programming language. Gren is no longer developed by a single developer, but by a core team.\\n\\nFor the past couple of years I've been working on Gren by myself, with help from the small community that has formed around it. This has been a necessity, but it was never the goal. I'm of the belief that software, especially when used by a large and diverse set of users, is best developed in a team with developers of different expertise and experience. There are too many use- and edge cases for a single developer to predict them all.\\n\\nIt's vital that all members of a development team share the same philosophy and understanding of the software they are developing. Otherwise the result will quickly feel like a mish-mash of ideas, as opposed to a cohesive tool.\\n\\nFinding like minded individuals takes time, but I believe I've found someone who shares my ideas of what Gren should be and has the same drive to see it successful.\\n\\n## Introducing Justin Blake\\n\\nJustin (A.K.A blaix) has brought welcome attention to Gren through the [prettynice](https://github.com/blaix/prettynice) and [gren-tui](https://github.com/blaix/gren-tui) frameworks, implemented the [HttpServer API in gren-lang/node](https://packages.gren-lang.org/package/gren-lang/node/version/latest/module/HttpServer), greatly improved the [language documentation](https://gren-lang.org/book/) and served as a kind and helpful member on our community chat.\\n\\nIncluding Justin in the core team is both a recognition of his contributions to the project, and a way to enable him to do greater things in the future.\\n\\n## What is a core team?\\n\\nThe core team is tasked with ensuring the long-term success of the Gren programming language.\\n\\nThis description is intentionally vague.\\n\\nWhile a language requires careful design and active development, it's just as important to have a vibrant community, good tooling, great third-party packages and frameworks. It's the responsibility of the core team to improve Gren in all of these aspects, and more.\\n\\nThe core team also serve as the decision makers for how the language will evolve in the future. That said, major changes to the language will continue to be discussed with the community prior to implementation.\\n\\nWith a core team in place, Gren is more resilient to failure and in a better position to grow. While Justin is the first addition  to the team, I doubt he will be the last.\\n\"}","1828973924":"{\"parsedFrontmatter\":{\"title\":\"Gren 0.3.0: Source maps\",\"published\":\"2023-06-19\"},\"withoutFrontmatter\":\"\\nJavaScript developers have always had access to a powerful debugger for finding bugs in their applications. Since Gren compiles to JavaScript, it's also possible to use the same tool for debugging Gren applications. The experience isn't great, however, as you're forced to debug the JavaScript that the compiler spits out instead of the actual code you wrote.\\n\\nUntil today, that is.\\n\\nGren 0.3.0 is now released, and with it comes the option of outputting source maps.\\n\\nSource maps is a JSON data structure that the JavaScript runtime can read in order to understand the relation between the currently running code, and the source code it orignated from. When source maps are available, you can actually debug Gren code in the JavaScript debugger.\\n\\nAll you have to do is to pass the `--sourcemaps` flag to the compiler:\\n\\n```sh\\ngren make src/Main.gren --sourcemaps\\n```\\n\\nTo see how source maps improves Gren's debugging experience, you can watch [Robin's demo](https://youtu.be/Fly0y4lFgDc?t=515) of this feature on youtube.\\n\\n## What's next?\\n\\nWith the release of Gren 0.3, focus now turns to the 0.4 release in December. The main feature for that release will be Parametric Modules, which you can learn more about in this [Github issue](https://github.com/gren-lang/compiler/issues/81) or in this [video presentation](https://youtu.be/Fly0y4lFgDc?t=1099).\\n\\nThat's all for now. Head over to the [install page](/install) to get started.\\n\"}","1981034955":"{\"parsedFrontmatter\":{\"title\":\"Gren 0.2.1: Testing, testing\",\"published\":\"2023-03-15\"},\"withoutFrontmatter\":\"\\nThe original plan was to not do another release until Gren 0.3 this summer but, while this is still the goal, we've implemented enough functionality to warrant a new release today. The theme for Gren 0.3 is \\\"Testing and Debugging\\\", and Gren 0.2.1 delivers on the first half of this theme.\\n\\n## Local dependencies\\n\\nWith Gren 0.2 and earlier, you could only depend on packages which had a semver-formatted tag on github. For users of a package this works pretty well. For developers of a package, there isn't any easy way to test the package in a project _prior_ to publishing the tag.\\n\\nGren 0.2.1 adds support for local dependencies. Local dependencies are packages that reside on your local disk. Here's how you define a local dependency:\\n\\n```json\\n{\\n  \\\"type\\\": \\\"application\\\",\\n  \\\"platform\\\": \\\"node\\\",\\n  \\\"source-directories\\\": [\\n    \\\"src\\\"\\n  ],\\n  \\\"gren-version\\\": \\\"0.2.1\\\",\\n  \\\"dependencies\\\": {\\n    \\\"direct\\\": {\\n      \\\"gren-lang/node\\\": \\\"1.2.0\\\",\\n      \\\"gren-lang/core\\\": \\\"local:..\\\",\\n      \\\"gren-lang/test\\\": \\\"1.0.0\\\",\\n      \\\"gren-lang/test-runner-node\\\": \\\"1.0.0\\\"\\n    },\\n    \\\"indirect\\\": {\\n    }\\n  }\\n}\\n```\\n\\nThe above `gren.json` is taken from the `test` folder of [gren-lang/core](https://github.com/gren-lang/core). As you can see, `gren-lang/core` is here defined as local dependency where the package is defined to reside in the parent folder.\\n\\nLocal dependencies has several limitations. The compiler will refuse to compile dependencies which themselves have local dependencies, and `gren package validate` will fail if a local dependency is defined./a\\nGren will also refuse to compile local dependencies which contain kernel code, that isn't also part of a git commit signed by Gren's lead developer.\\n\\n## An official test framework\\n\\nGren now has two packages allowing you to test your implementation. \\n\\n[gren-lang/test](https://packages.gren-lang.org/package/gren-lang/test) is a port of [elm-exploration/test](https://package.elm-lang.org/packages/elm-explorations/test/latest), and is a package for defining tests.\\n\\n[gren-lang/test-runner-node](https://packages.gren-lang.org/package/gren-lang/test-runner-node) allows you to define a Node.JS application that runs your defined tests.\\n\\nA minimal test program looks like the following:\\n\\n```gren\\nmodule Main exposing (main)\\n\\nimport Expect\\nimport Test exposing (Test, describe, test)\\nimport Test.Runner.Node exposing (Program, run)\\n\\nmain =\\n    run <|\\n        describe \\\"Tests\\\"\\n            [ test \\\"Always true\\\" <| \\\\_ ->\\n                Expect.pass\\n            ]\\n```\\n\\nTo run it, you need to do the following:\\n\\n```sh\\ngren compile src/Main.gren --output run_tests\\nnode run_tests\\n```\\n\\nIn order to write tests for your package, you can define a test application that imports your package as a local dependency.\\n\\nYou can see an example of this in [gren-lang/core](https://github.com/gren-lang/core/tree/e78cc321fc7521b87c0a60c04f5d911a9442db99/tests)'s test suite.\\n\\n## What's next\\n\\nThe next release will arrive this summer, and focus on code generation improvements for easier debugging and better performance. Hopefully, this release will also include support for generating source maps so that you can debug Gren code instead of the generated JavaScript.\\n\\nThat's it for now. Head over to the [install page](/install) to get started.\\n\"}","2221335246":"{\"parsedFrontmatter\":{\"title\":\"Upcoming language changes\",\"published\":\"2024-08-19\"},\"withoutFrontmatter\":\"\\nEvery time Gren gets a bit of attention, as it recently did with the release in June, someone will notice that Gren began its life as a fork of Elm and ask me to put that in plain writing on the website or the compiler's README.md.\\n\\nThe reason I don't want to make that connection more apparent than it already is, is that I don't want to give people the impression that Gren is just Elm with new management, or a more actively developed Elm.\\n\\nIt isn't.\\n\\nWhile Gren looks pretty similar to Elm at a surface level, it has diverged enough that porting a project from one to the other is a little painful, and that pain will only grow over time.\\n\\nWhile Gren shares the same underlying philosophy as Elm, they are independent languages and will continue to evolve without consideration to how easy it is to port code between them.\\n\\nAt this point you might be thinking: \\\"Evolve? How?\\\"\\n\\nWhat follows is a list of changes that I'm certain will be implemented in the next year or two. This list isn't exhaustive,  but gives a good impression of the direction of the language.\\n\\nIf you've got experience with Elm but are new to Gren, it might be a good idea to [read how Gren differs from Elm](https://gren-lang.org/book/appendix/faq/) before continuing.\\n\\n## New syntax for type aliases\\n\\nType aliases are going to become much more common in Gren (more on this later), and for that reason it might be worth reducing the keystrokes required to make them.\\n\\nThe syntax for defining a type alias will change from \\n\\n```\\ntype alias Named = { name : String }\\n```\\n\\nto\\n\\n```\\nNamed : { name : String }\\n```\\n\\nI first saw this syntax in [Roc](https://www.roc-lang.org/) and it instantly felt like a good idea. Not only is it shorter, but it feels natural since it's exactly how you define the types of functions and values elsewhere.\\n\\n## Opaque aliases\\n\\nWhen defining custom types, you can decide between exposing just the name of the custom type, or the name as well as its constructors. We call the former opaque types. You can refer to the type, but you can't make any assumptions about what the type represents.\\n\\nWe're intending to allow for opaque type aliases. That is, you will be able to expose only the name of an alias, and not what it is an alias of. In the case of records, this means you no longer need to wrap a record in a custom type in order for it to be opaque.\\n\\n```\\nmodule Example exposing\\n  ( OpaqueRecord\\n  , ExposedRecord(..)\\n  )\\n  \\nOpaqueRecord : { secret : String }\\n\\nExposedRecord : { gossip : String }\\n```\\n\\nThe downside is that you need to add type annotations to any function that takes in or returns opaque values, otherwise the compiler will infer the literal (non-opaque) type.\\n\\n## Structural sum types\\n\\nCurrently, you can define sum types like this:\\n\\n```\\ntype Fruit\\n  = Apple\\n  | Banana\\n```\\n\\nThis type is nominal. You cannot define a function that accepts any type as long as it has an `Apple` constructor, or as long as it is a superset of `Fruit`. Neither can the compiler infer the type based on usage. It must be defined.\\n\\nThis is in contrast to how records work. Records are structural. You can define a function that works on any record as long as it has a specific set of fields. Records can be inferred. You can even define records as extensions of other records.\\n\\nGren intends to make sum types structural. As a consequence, we don’t need a specific language construct for defining a sum type. Naming sum types can simply be done with aliases:\\n\\n```\\nFruit : | Apple | Banana\\n```\\n\\nNote the leading pipe symbol. It's what separates sum types from other types.\\n\\nThis is a feature that you'll also find in Roc, but I actually [first heard of the idea on the Elm discourse](https://discourse.elm-lang.org/t/idea-extensible-union-types-and-benefits-they-bring-for-real-world-elm-code/6118) back in 2020. Of course, it probably exists in a few other languages as well.\\n\\nWhile on the topic of sum types, Gren will further limit them to 0 or 1 arguments. The reasons behind this overlaps with [why tuples where removed](https://youtu.be/Sl9HHo1qDk0?si=wiJjSEMyl0f6HqTn), but there's also a performance argument to be made.\\n\\nBy making all sum type constructors take at most 1 argument, we can implement it as a simple object, which means the JavaScript engine will treat pattern matches on sum types as monomorphic code and optimize it well.\\n\\n## Parametric modules\\n\\nTo me, the biggest shortcoming of Elm (besides lacking first-class support for a server/terminal environment) is that you cannot easily store any given type as the key in a `Dict` or as an item in a `Set`. These types only accept things that are `comparable`, and that is a category you're not allowed to expand.\\n\\nThere are ways to work around this, sure, but considering how useful these data structures are it's a shame that you need to put in extra work in order to make full use of them.\\n\\nAnother thing that is a shame is that you're bound to `comparable`. Need the performance of a hash map? You now need to create a layer of abstraction for each type you'd like to store, or you would have to store the hash function in the instance of the data structure. If you choose the latter, running `==` on anything containing your hash map will crash at runtime.\\n\\nIn a statically typed language as strict as Elm, useful data structures like `Dict` and `Set` shouldn't nudge you towards primitive types.\\n\\nGren will at some point remove `appendable`, `comparable`, `number` and reflection-based functions like `==`. Instead, Gren will offer parametric modules.\\n\\nParametric modules allows you generate new modules at compile time. If you want a `Dict` that uses `MyType` as the key, you can generate that. If you want a `HashMap` where the key is an `(Array (Array Int))` you can generate that as well.\\n\\nIt will look something like the following:\\n\\n```\\nimport Dict MyType as MyTypeDict\\nimport Dict String as StringDict\\n```\\n\\n`MyTypeDict` and `StringDict` are two different modules, but generated based on the same template.\\n\\nIt's important to point out that `MyType` and `String` are not referring to types, but modules. It's possible to define a `ReverseCompareString` module that when passed as an argument to `Dict` will still use `String` as keys, but where the keys will be stored in reverse alphabetical order.\\n\\nYou can [read more about parametric modules on this github issue](https://github.com/gren-lang/compiler/issues/81).\\n\\nNow you might wonder: \\\"what's wrong with type classes?\\\"\\n\\nMy interpretation of why type classes never made it into Elm was because (1) it's hard to write good error messages when you are dealing with abstract types and interfaces and (2) it's easy to define and implement a type class that they have a habit of being used everywhere, even when there's no need.\\n\\nFor me, the biggest problem is that type classes form a global namespace. If someone implements a type class for a type, then no one else can provide a different implementation for that type, unless you're being clever/lucky with the imported modules. With parametric modules there is no global namespace. You can define three `Dict String`s, all with different comparison functions.\\n\\nI also think parametric modules require a bit of planning to use well, so they're not as likely to be used everywhere type classes are (which I consider a plus).\\n\\n## Overridable operators\\n\\nWithout type classes like `number`, `comparable` and `appendable`, we need to re-consider how operators work in Gren.\\n\\nThe current implementation of operators is a bit confusing. The language itself has support for custom operators, but it's locked down so that only the core team are allowed to use it.\\n\\nThe reasoning behind this is that custom operators can easily make code unreadable, as it's hard to remember the meaning of a foreign symbol and how they work regarding associativity and precedence. On the other hand, for mathematical expressions it's easier to read code that uses mathematical operators compared their function-based substitute. The limit on defining custom operators was meant to preserve a balance between too many and too few operators.\\n\\nUnfortunately, you can find several examples of unnecessary operators in Gren's own core packages, like the `url` package and the `parser` package. These operators don't make any sense outside of their respective packages, and I believe many people are annoyed that there are different rules for the general community and the core team.\\n\\nThe currently defined operators could also be more flexible. It makes perfect sense to allow a `BigInt` type to be used in mathematical expressions, or allow the `++` operator on any sequence-like data structure, even those defined in third-party packages.\\n\\nTo solve both of these problems, a future version of Gren will remove syntax for defining custom operators. Operators will be reduced to a fixed set and treated like (special) functions.\\n\\nLets look at an expression like `a + b`. What is `+` in this case? In the future that will depend on what you have in scope. If you have an import statement like `import Int exposing (+)`, then `a + b` will represent integer addition.\\n\\nYou can define your own implementation of `+`:\\n\\n```\\n(+) : BigInt -> BigInt -> BigInt\\n(+) a b =\\n  (BigInt.toInt a) Int.+ (BigInt.toInt b)\\n```\\n\\nAs you can see, we'll also allow qualified operators like `Int.+` so that it's possible to refer to different implementations of a given operator within a module.\\n\\nIt's important to note that you won't be allowed to define entirely new operators, or redefine precedence and associativity rules for existing ones. \\n\\n## Wrapping up\\n\\nAs mentioned, these are features I'm certain will make it into the language in the next couple of years. Most, if not all, of these will arrive when the parser is rewritten in Gren.\\n\\nIf you'd like to keep updated on the progress on these and other language features feel free to join us on [Discord](https://discord.gg/Chb9YB9Vmh).\\n\"}","2331668781":"{\"parsedFrontmatter\":{\"title\":\"Gren-in-Gren, and other developments\",\"published\":\"2024-03-21\"},\"withoutFrontmatter\":\"\\nThe first few lines of a new Gren compiler are being written this week. The goal is to better support upcoming features of the language, as well as being easier to maintain and debug. The hope is also that it will be easier for the community to contribute, as the new compiler is being written in Gren itself.\\n\\nThe goal is to rewrite the compiler incrementally and release each new piece of the compiler as it is ready. You can still expect new features every six months,\\nand the first version of the compiler that contains Gren code will be Gren 0.4, scheduled for June.\\n\\nFor more details on Gren-in-Gren, check out the YouTube video below.\\n\\n[![Robin and Justin demoing new functionality](https://img.youtube.com/vi/t6TVmM_664o/0.jpg)](https://www.youtube.com/watch?v=t6TVmM_664o)\\n\\n## HttpClient for Node.js based applications\\n\\nIn addition to Gren-in-Gren, the video also demos the new HttpClient API in [gren-lang/node](https://packages.gren-lang.org/package/gren-lang/node/version/3.2.0/overview). This means that you can now create HTTP servers and make HTTP requests\\nwhen writing Gren applications that target the node platform.\\n\\nAs if that wasn't enough, [Justin Blake](https://github.com/blaix) shows up in the video to demo the new [Prettynice web framework](https://github.com/blaix/prettynice) for Gren, that makes it easy to write a Gren-based backend with Gren-based components\\non the frontend.\\n\\n## Improved core packages\\n\\nGren's core packages (`gren-lang/core`, `gren-lang/node` and `gren-lang/browser`) have all been updated. Besides the already mentioned HttpClient API for node, the `gren-lang/web-storage` package has been consolidated\\nwith `gren-lang/browser`, and several bugs have been squashed. The documentation has also been updated to be easier to read.\\n\\nHere's a few notable bugs that have been fixed:\\n\\n* We correctly refer to the _Elm_ architecture in our documentation. This was incorrectly renamed to the Gren architecture in the initial days of the project.\\n* The time-travelling debugger failed to show up in browser applications.\\n* The time-travelling debugger overlay now has a class attached, so you can easily hide or move it using CSS.\\n* `Bytes` now work with `==`\\n* `Regex.fromString \\\"\\\"` now returns `Nothing`\\n* `logBase 10` is now more precise by utilizing the JavaScript builtin `Math.log10` function. `logBase 10 1000` now returns 3, as you'd expect.\\n* The `String` API now makes no attempt to concatenate UTF-16 surrogate pairs. Gren strings are now plain old JavaScript strings. This should improve performance, and fix a few bugs, at the cost of not being more like JavaScript.\\n\"}","2384614171":"{\"parsedFrontmatter\":{\"title\":\"Gren 0.2: Hello, NodeJS\",\"published\":\"2022-12-12\"},\"withoutFrontmatter\":\"\\nSix months after the release of 0.1, a new release is here with a bunch of exciting features. This includes a built-in code formatter and basic support for creating applications that run on NodeJS.\\n\\n## Platforms\\n\\nWhen defining new projects, you now need to specify which platform you're targeting. There are three platforms to choose from: `common`, `browser` and `node`. The latter two decide where the application can run, wheras the `common` platform indicates that your code can run anywhere. In other words, packages targeting the `common` platform can be dependencies of either `browser` and `node` projects.\\n\\nIn practical terms, the platform setting decides which core packages you're allowed to depend on. If you're targeting the `browser` platform, you're _not_ allowed to depend on `gren-lang/node`, directly or indirectly. Likewise, a project targeting the `node` platform is forbidden from depending on `gren-lang/browser`. When targeting the `common` platform, you can depend on neither.\\n\\nIn order to make it easier to setup a project correctly, we've added two flags to the `gren init` command: `--package` and `--platform`. For instance, if you want to create a package project targeting the `node` platform, you can run:\\n\\n```sh\\ngren init --package --platform node\\n```\\n\\nIf you'd rather create a `node` application, then just leave out the `--package` flag.\\n\\nThe long-term goal is to support all built-in NodeJS API's, but currently we only support a small subset. To get a better idea of what's possible you can read the [gren-lang/node documentation](https://packages.gren-lang.org/package/gren-lang/node) or take a look at the [cat example program](https://github.com/gren-lang/example-projects/tree/main/cat).\\n\\nYou might also want to take a look at this [live demo](https://www.youtube.com/watch?v=IGEOvIHDlBI) where Robin implements the unix echo program in Gren.\\n\\n## Formatting\\n\\nAaron VonderHaar, the author of `elm-format`, was working on a formatting tool for Gren before 0.1 was even released. With Gren 0.2, this tool is now ready to use.\\n\\nTo format your project, simply run `gren format`. To validate the formatting of a project, just run `gren format --validate`.\\n\\nWhile the formatter should work well enough for most projects, it's not finished. Bugs and less-than-stellar formatting is to be expected in some cases. If you come across any interesting behaviour, please let us know.\\n\\n## Package consolidation\\n\\nSeveral different packages have now been consolidated into fewer, but bigger packages. For example: `gren-lang/virtual-dom`, `gren-lang/html` and `gren-lang/svg` are now merged into `gren-lang/browser`.\\n\\nThe main reason for doing this has to do with project management. It's easier for me to deal with 5 bug trackers than 15, and it takes less time to migrate and publish 5 packages to Gren 0.2, instead of 15.\\n\\nAt the same time, there aren't really any downsides to developers. Fewer packages means less time being spent downloading packages, and since Gren has excellent dead-code elimination, your compiled output isn't getting bigger either.\\n\\nEverything hasn't been consolidated, though. `gren-lang/url`, `gren-lang/parser` and `gren-lang/web-storage` do still exist and will continue to do so until I'm certain that their API is stable enough to be consolidated into one of the \\\"big three\\\" packages.\\n\\nGoing forward, new functionality is likely to be introduced in standalone packages, then become merged into the right platform package when the API has stabilized.\\n\\n## Package management\\n\\nThe package manager has improved in almost every way.\\n\\nIt is now significantly faster, gives detailed error messages when you have incompatible dependencies in your project, and has learned a few new tricks to make it easier to manage your dependencies.\\n\\nThere's now a `gren package uninstall` command for removing a dependency from your project, as well as `gren package outdated` for seeing which dependencies are out of date.\\n\\n## New language features\\n\\nGren 0.2 also brings a few new language features. These don't radically change the language in any way, but provide small quality-of-life improvements.\\n\\n### Record update now works on any expression\\n\\nIn 0.1, record update syntax only worked on variable names, like this:\\n\\n```gren\\noriginalRecord = { value = \\\"original\\\" }\\n\\nupdatedRecord = { originalRecord | value = \\\"updated\\\" }\\n```\\n\\nHowever, any other expression isn't legal. So you can't do things like this:\\n\\n```gren\\nupdatedRecord = { OtherModule.originalRecord | value = \\\"updated\\\" }\\n```\\n\\nThis is one of the only places where we have such limitations. For instance, we don't limit what expressions you can have in `if` expressions or `case` expressions, or even inside literals. So it's confusing when a limitation like this exists.\\n\\nIn 0.2, you can now use record update syntax with _any_ expression. The above snippet will now compile, but so will much more complex expressions.\\n\\nThis change was contributed by Julian Antonielli.\\n\\n### Import aliases can now contain dots\\n\\nExactly what it says on the tin, the following import statement is now legal:\\n\\n```gren\\nimport Much.Nested.Module.Path as Nested.Path\\n```\\n\\n### Named unused constants\\n\\nWhen pattern matching or defining functions, you can use `_` to ignore a value. Here's an example:\\n\\n```gren\\nlength : Array a -> Int\\nlength array =\\n    Array.foldl (\\\\_ len -> len + 1) 0 array\\n```\\n\\nSometimes, it can be helpful to attach a name to the ignored value, as a reminder for what the value represents. In 0.2, you can do just that:\\n\\n```gren\\nlength : Array a -> Int\\nlength array =\\n    Array.foldl (\\\\_value len -> len + 1) 0 array\\n```\\n\\nNote: trying to use `_value` will trigger a compilation error.\\n\\nThis feature was contributed by Allan Clark.\\n\\n### Multi-line strings trims leading whitespace\\n\\nGren has dedicated syntax for defining a multi-line string. It looks like this:\\n\\n```gren\\nstr =\\n    \\\"\\\"\\\"\\n    this\\n      is a\\n    string\\n    \\\"\\\"\\\"\\n```\\n\\nIn 0.1, this is equivalent to\\n\\n```gren\\nstr = \\\"\\\\n    this\\\\n      is a\\\\n    string\\\\n\\\"\\n```\\n\\nIn 0.2, multi-line strings trims away a common number of leading whitespace on each line, so that the multi-line string compiles to the equivalent of:\\n\\n```gren\\nstr = \\\"this\\\\n  is a\\\\nstring\\\"\\n```\\n\\n## What's next?\\n\\nThe 0.2 release is a big release, but we have no intention of stopping here. The 0.3 release will focus on testing & debugging, and will include features such as an official test framework, source maps for viewing Gren code in a JavaScript debugger and improved code generation.\\n\\nSince Gren will continue with its six-month release cadence, 0.3 is scheduled for release in June 2023.\\n\\nThat's it for now. Head over to the [install page](/install) to get started.\\n\"}","2885376689":"{\"parsedFrontmatter\":{\"title\":\"Documentation as a first class citizen\",\"published\":\"2022-08-22\"},\"withoutFrontmatter\":\"\\nA crucial aspect of any programming language, is how easy it is to discover and learn new functionality.\\n\\nOne of the most common questions asked since [Gren's first release](/news/220530_first_release) is \\\"what can I do with Gren?\\\" and \\\"where can I see what's in the core package? I don't have to read the code, do I?\\\".\\n\\nSearching through github and reading source code is far from the easiest way to discover and learn the finer details of a language, so today we're proud to announce the availability of [packages.gren-lang.org](https://packages.gren-lang.org). Here you can learn the documentation of Gren's core packages, and discover third-party packages as they arrive.\\n\\n### Discoverability\\n\\nThe packaging site provides full-text search to allow people to find a package by author, package name and keywords in the package summary. In addition, all recently updated packages are listed on the front page.\\n\\nIf you're a member of our [Zulip](https://gren.zulipchat.com), new package versions are posted to the `#packages` topic, so that you can discover new packages as they arrive.\\n\\n### Previewing documentation\\n\\nWhen you install the package site with [npm](https://www.npmjs.com/package/gren-packages) (`npm install -g gren-packages`), you get access to a binary called `gren-doc-preview` which will generate documentation for the package in your current directory, and host a local copy of the packaging site to display it. This let's you see exactly how the documentation will look when imported into the main packaging site, which helps you perfect your documentation with minimal effort.\\n\\n### Easy to self-host\\n\\nThe packaging site is easy to self-host. It runs on Node 16 and uses SQLite as its database. You can run it on your own machine in order to have access to documentation offline, or you can host it on a server to host the documentation for your private packages.\\n\\nJust like the Gren compiler, the packages site uses your local install of Git to retrieve packages from Github. As long as your git client has access to a Gren repo, the packages site can import it as well.\\n\\n### Future enhancements\\n\\nToday marks the first release, but it certaintly won't be the last. Several new features are planned for the future, like being able to mirror another package server, extensive caching and recursive imports of the dependencies of a package.\\n\\nWe believe that this new packaging site will enable new developers to discover new packages and learn how those packages work.\\n\\nAs always, if you've got some idea on how to improve it, we hope to discuss it further on our [Zulip](https://gren.zulipchat.com). See you there?\\n\"}","3511580521":"{\"parsedFrontmatter\":{\"title\":\"Gren 0.4.5: Performance, Debugging, Web Crypto\",\"published\":\"2024-08-26\"},\"withoutFrontmatter\":\"\\nNew versions of the compiler and core packages are now available. You can expect better performance, improved debugging and more functionality.\\n\\n## Performance\\n\\nThe compiler generates more efficient JavaScript for function calls when it knows that the function in question isn’t curried. This reduces the call stack and makes it easier for the JavaScript engine to optimize the code.\\n\\nThis release also fixes a regression where math and comparison operators weren’t inlined properly for primitive types.\\n\\nTogether, these changes have resulted in a 2.8x improvement in the execution time of this particular program:\\n\\n![Generating the 40th fibonacci number](/fib_code.png)\\n\\nThe implementation of [Array.pushLast](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Array#pushLast) has also been improved, and now runs up to 3x faster.\\n\\nA new module, [Array.Builder](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Array.Builder), has been added to further improve performance of building large `Array`s. It uses mutation under the hood, but it isn't observable outside of a debugger.\\n\\nIn summary, you should see noticeable improvements in performance with the latest compiler and core packages.\\n\\n## Improved debugging\\n\\nThe changes to the compiler also improves debugging by cleaning up the call stack. Function names now show up for uncurried function calls, and you’ll see a lot less application helpers (A2, A3, A4...).\\n\\nSourcemaps now also include the location of anonymous functions, which again improves the accuracy of the call stack while debugging.\\n\\nA bug causing wrong line numbers for NodeJS applications have been fixed, as has a bug omitting the last line of the sourcemap.\\n\\n## Web Crypto\\n\\nGren programs now have access to the [Web Crypto API](https://developer.mozilla.org/en-US/docs/Web/API/Web_Crypto_API). This lets you sign, verify, encrypt and decrypt `Bytes`, as well as generate UUIDv4 strings and random `Bytes` with a secure algorithm.\\n\\nThe [Crypto](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Crypto) module was implemented by Joey Bright, marking his first contribution to the core packages.\\n\\n## A note on the ChildProcess API\\n\\nThere’s a bug in the 0.4.4 compiler where the exit code is always zero, even when compilation fails.\\n\\nThis stems from missing functionality in the [ChildProcess](https://packages.gren-lang.org/package/gren-lang/node/version/4.2.0/module/ChildProcess) module. In order to fix this issue in a backwards compatible way, Justin Blake has added a new function called [ChildProcess.spawnAndNotifyOnExit](https://packages.gren-lang.org/package/gren-lang/node/version/4.2.0/module/ChildProcess#spawnAndNotifyOnExit) which works exactly like [ChildProcess.spawn](https://packages.gren-lang.org/package/gren-lang/node/version/4.2.0/module/ChildProcess#spawn) except that it notifies the application when the child process exits and which code it exited with.\\n\\nThis is just a temporary fix. We intend to rewrite the [ChildProcess](https://packages.gren-lang.org/package/gren-lang/node/version/4.2.0/module/ChildProcess) module in the next major release in order to clean up the API and add new functionality.\\n\\n## New functions\\n\\nBesides the new [Array.Builder](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Array.Builder) and [Crypto](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Crypto) modules, existing modules have been updated with new functions:\\n\\n* [Array.insert](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Array#insert)\\n* [Array.insertMany](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Array#insertMany)\\n* [Array.remove](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Array#remove)\\n* [Array.removeMany](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Array#removeMany)\\n* [Array.setMany](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Array#setMany)\\n* [Array.splice](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Array#splice)\\n* [Bitwise.countLeadingZeros](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Bitwise#countLeadingZeros)\\n* [Dict.updateWithDefault](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Dict#updateWithDefault)\\n* [Math.maxFloat](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Math#maxFloat)\\n* [Math.maxSafeInteger](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Math#maxSafeInteger)\\n* [Math.minFloat](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Math#minFloat)\\n* [Math.minSafeInteger](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Math#minSafeInteger)\\n* [Maybe.checkValue](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Maybe#checkValue)\\n* [Maybe.filter](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Maybe#filter)\\n* [Maybe.hasValue](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Maybe#hasValue)\\n* [Maybe.withDefaultLazy](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Maybe#withDefaultLazy)\\n* [Result.allOk](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Result#allOk)\\n* [Result.checkValue](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Result#checkValue)\\n* [Result.firstOk](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Result#firstOk)\\n* [Result.hasValue](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Result#hasValue)\\n* [Result.onError](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Result#onError)\\n* [Result.withDefaultLazy](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Result#withDefaultLazy)\\n* [Set.toggle](https://packages.gren-lang.org/package/gren-lang/core/version/5.1.0/module/Set#toggle)\\n\"}","3799345669":"{\"parsedFrontmatter\":{\"title\":\"Gren 0.4: New foundations\",\"published\":\"2024-06-24\"},\"withoutFrontmatter\":\"\\nThe core packages have been updated with new functionality and quality-of-life improvements. The compiler has started its transition from Haskell to Gren. The book has seen a face lift, and Zulip has been replaced by Discord.\\n\\nInterested? Let's dig in.\\n\\n## New filesystem API\\n\\n[![Robin demonstrates the new FileSystem API](https://img.youtube.com/vi/fwLP6WVLJWU/0.jpg)](https://www.youtube.com/watch?v=fwLP6WVLJWU)\\n\\nThe FileSystem API was functional, but minimal. It has been replaced by three new modules: `FileSystem`, `FileSystem.FileHandle` and `FileSystem.Path`.\\n\\n* `FileSystem` contains functions for working with the file system.\\n* `FileSystem.FileHandle` allows you to open a file, perform several operations on it and then close it again.\\n* `FileSystem.Path` gives you a statically typed, cross-platform, representation of a file system path.\\n\\nTogether, these modules give you access to most of the file system operations available in NodeJS.\\n\\nIf you want more information about the new FileSystem API, be sure to watch the video linked above.\\n\\n## Gren-in-Gren\\n\\nThis release contains the first few lines of what will eventually be a ground-up rewrite of the compiler in Gren. While\\nit currently does little more than downloading and executing the Haskell-based compiler, it will eventually enable the\\nuse of compiler functionality (parsing, type checking, formatting) in Gren applications.\\n\\nThere are also several indirect benefits of the Gren-in-Gren rewrite, like lowering the barrier of contributing to the\\ncompiler, and improving the quality of the Gren core packages by virtue of compiler authors now also being Gren-developers.\\n\\nIn fact, the mentioned rewrite of the FileSystem API is a direct consequence of the compiler needing more functionality\\nthan what was previously available.\\n\\nWe'll talk more about the importance of Gren-in-Gren at a later time.\\n\\n## The book has received a face lift\\n\\nJustin Blake has contributed big changes to [the book](https://gren-lang.org/book), which serves as our language guide.\\n\\nNot only has he filled in empty chapters and added a few new ones, he's also replaced the generator with Astro Starlight.\\nOne of the biggest consequences of this change is that you can now search for topics of interest.\\n\\n## We've moved to Discord\\n\\nSince the very first release of Gren we've been using Zulip to coordinate development of the language. Over time we've received feedback\\nthat Zulip might not have been the best choice. Many people feel that they're drowning in communication platforms, so the bar for joining\\nyet another platform is pretty high.\\n\\nWhile our experience with Zulip has been good, the future success of Gren depends on an active community.\\nUsing the best tool means nothing if we're using it alone.\\n\\nWe've now decided to use [Discord](https://discord.gg/Chb9YB9Vmh) for discussing and sharing all things related to Gren. Why don't you join us?\\n\\n## Misc. changes\\n\\n* Using multi-line string syntax for a single-line string is now a compile error.\\n* If the `NO_COLOR` environment variable is set, color will be stripped from the compiler output.\\n* `Stream.sendX` and `Node.exit` functions are now `Task`-based. This makes them easier to compose with other `Task`s.\\n* You now have access to the location of the current executing program.\\n* You can now set the title of the currently running process.\\n* Removed `always`, use anonymous functions instead.\\n* `Bytes` now have convenience functions for converting between `Bytes` and `String`.\\n* `Bytes.join` allow you to build `Bytes` from `Array Bytes`. Useful when retrieving several `Bytes` from `HttpClient`.\\n* Performance improvements of several `Array` functions.\\n* Added `Array.indexedFold`.\\n* Added several new functions to `Dict` and `Set`.\\n* Removed `Dict.fromArray`. Use a pipeline of `Dict.set`, or `Dict.set` in a `fold`.\\n* Added `Task.execute` to run a `Task` without triggering a message to your application's `update` function.\\n* Added `Task.await` for imperative-style composition of `Task`s.\\n\\n## Thank you, contributors\\n\\nThis release was made possible through contributions from the following people:\\n\\n* [CharlonTank](https://github.com/CharlonTank)\\n* [Gaute Berge](https://github.com/Gauteab)\\n* [Justin Blake](https://github.com/blaix)\\n* [pushfoo](https://github.com/pushfoo)\\n* [Revath S Kumar](https://github.com/revathskumar)\\n* [Robin Heggelund Hansen](https://github.com/robinheghan)\\n\"}"},"path":"news/240724_announcing_core_team"}